[
  {
    "id": "3649360531639949451",
    "title": "Attorney general pushes for New Mexico's first civil rights division",
    "description": "Attorney General Ral Torrez wants to create a civil rights division that would hold public officials and public bodies accountable.",
    "body": "Attorney general pushes for New Mexicos first civil rights division\nMatt Grubs | KOB\nALBUQUERQUE, N.M.  Attorney General Ral Torrez wants to create a civil rights division that would hold public officials and public bodies accountable  and he says hed focus first on protecting children.\nThe idea is to formally task the attorney general with monitoring equal justice under the law. So, if someone at the New Mexico Children, Youth and Families Department is not doing what theyre supposed to, or if schools are disciplining students unequally, the state can have an outside agency investigate and ask a court to order compliance.\nThe division would also monitor government officials across the board. So, if theres an issue with a sheriffs department, the division would investigate and recommend changes or civil enforcement.\nThe legislation to create the division, Senate Bill 426, passed its final committee Thursday morning and is waiting for a floor vote.\nClick on the video above for the full story.",
    "datePublished": "2023-03-16T23:46:59",
    "provider": { "name": "kob", "favIcon": "" },
    "image": {
      "name": null,
      "title": null,
      "provider": { "name": "kob", "favIcon": "", "favIconBase64Encoding": "" }
    }
  },
  {
    "id": "1971138990992219712",
    "title": "Some General reflection",
    "description": "Editors note: this is the first in a two-part series on the retirement of Ben Corell from the Iowa National Guard. Be sure to pick up Saturdays edition of The",
    "body": "Copy article link\nSave\nEditors note: this is the first in a two-part series on the retirement of Ben Corell from the Iowa National Guard. Be sure to pick up Saturdays edition of The Oelwein Daily Register for the conclusion of the story.\nFollowing a 37-year military career, northeast Iowa native Major General Ben Corell retired earlier this month from his position as the highest-ranking officer in the Iowa National Guard, marking the conclusion of a journey of service that spanned parts of five decades.\nBorn in Manchester and raised in Strawberry Point, Corell graduated from Starmont in 1979 before enlisting in the states Army National Guard in January 1986. After completing both his basic and advanced individual training at Fort Bennings Infantry school in Georgia, he earned his officers commission through the Iowa Military Academys Officer Candidate School at Fort Dodge in March 1989. This achievement catapulted him to a career in which he commanded and deployed units overseas at the Company, Battalion, Brigade and Division levels.\nThose deployments as Commander began in 2000, when he was sent to Saudi Arabia in support of Operation Desert Spring as leader of the Iowa Guards Company A, 1st-133rd Infantry. In the years that followed, Corell led teams in places such as Egypt (2003), Al Anbar Province in Iraq (2006-2007), Afghanistan and Bucharest, Romania (2016  2017). Most recently, having taken command of the 34th Infantry Division in December 2017, he led that unit during their deployment to Kuwait as part of Operation Enduring Freedom (SPARTAN SHIELD) from September 2018 to July 2019.\nBefore leaving his post, Corell reflected on his career, its role in shaping him and his upcoming retirement.\nIve had different people throughout my life that I felt, theyve challenged me, either unintentionally or overtly, to be something better than just status quo, Corell said, about what has motivated him, speaking from Iowa National Guard Joint Force Headquarters in Johnston on his final day as Adjutant General. And some of it from a positive standpoint and some of it from a negative standpoint that just motivated me and irritated me until I was like okay, Im going to show you what I can do.\nTrending Food Videos\nIt was in part that meliorism that led him to join the Iowa Guard though, as he described, that choice had much more to do with his familys circumstance amidst a challenging time.\nMaking the decision to join the Iowa National Guard wasnt easy, he said. I was on the farm in the fall of 1985. During the 1980s, it was tough going, and I decided this really wasnt going to be my future. My wife and I were married, we had three small kids at the time under the age of five.\nThen, as fate would have it, Corells wife happened to be reading a familiar publication one day, and her doing so would forever change the path of their lives.\nShe found an article in The Oelwein Daily Register about joining the Iowa National Guard. They had a $5,000 cash enlistment bonus at the time, he explained. So, that kind of caught my eye, which, in light of his familys situation, eventually led him to enlist.\nAnd though his subsequent experience in the Guard, which included numerous deployments and command responsibilities, was vast, Corell, when prompted, singled out one harrowing occasion that was particularly meaningful to him.\nFacebook",
    "datePublished": "2023-03-16T23:30:00",
    "provider": {
      "name": "communitynewspapergroup",
      "favIcon": ""
    },
    "image": {
      "name": null,
      "title": null,
      "provider": {
        "name": "communitynewspapergroup",
        "favIcon": ""
      }
    }
  }
]
