{
    "offset": 0,
    "number": 10,
    "available": 18478,
    "news": [
        {
            "id": 1878,
            "title": "Why China’s electric vehicles are all over Europe",
            "text": "On the Mediterranean island of Corsica, halfway between Marseilles and the Italian shore, stands a rental car lot fitted with Europe’s finest automobiles: German Audis, Italian Fiats, and Spanish Peugeots. Lately, it has featured a new offering: an electric SUV, in silver or azure, with an alien logo — five oblong plates arrayed in the shape of an “X.” The brand is “Aiways,” a portmanteau of the Mandarin word for “love” (ai) and the English phrase “on the way.” (In Chinese, the company is called 爱驰汽车 aìchí qìchē) The rental agent Hertz Corsica recruited the help of Aiways, an all-electric Chinese startup, as part of an island-wide electrification scheme in the summer of 2020. “We looked at our historical suppliers, but they just didn’t have enough volume to offer,” said Jean-Noel Filippo, the general manager, to French media. The Aiways-Corsica deal appeared to subvert the once-universal symbol of Europe as the leading maker of automobiles. China’s electric vehicle fleet has recently put the rest of the world’s markets on notice. There are around 50 Chinese companies making cutting-edge cars and components, over a dozen of which are now selling cars in Europe. Aiways was founded in Shanghai in 2017, and began exporting its first model, the all-electric battery-powered U5, to Europe just a year later. In 2021, the newcomer sold more than a thousand units to 11 EU countries including the Netherlands, France, and Denmark. Europe is now a beachhead for Aiways and many other up-and-coming Chinese EV brands. Across China’s industrial heartland, high-tech goods are replacing the cheap fare of yesteryear — the shoes, trinkets, and paraphernalia of Western suburbia. In the next stage of Chinese growth, the electric vehicle is the trump card. Not long ago, Japan and South Korea made a similar journey West, vying in markets long synonymous with great powers and modernity. After decades of state planning, a pandemic, and urgent global attention to climate change, China is next in line. How COVID fueled the growth of Chinese EV companies Ambitious emissions targets and the lack of indigenous players are opening European auto markets up to Chinese imports. Under the E.U’s climate plan, 30 million electric cars must be sold by 2030. Last year, despite record sales, only 2.2 million EVs were sold. While traditional European marques like Renault, Volkswagen, and Fiat have promised a full-throated pivot to electric, they are held back by their internal combustion engine past. With very few pure electric start-ups raised on European soil, the continent is structurally receptive to new entrants with green DNA. China accounts for half of all electric vehicles sold globally. Last year, 3.5 million of them hit Chinese roads, well over double the year prior. The burst of enthusiasm is partly the outgrowth of a decades-long policy blueprint. “It was not an advantage for China to be dependent on a carbon-based energy supply chain,” Bill Russo, founder and CEO of Automobility Ltd., an advisory firm in Shanghai, told me.” To wean itself off fossil fuels, the Gatorade of American imperialism, national documents began mulling plans for “renewable energy” and “electrification” as early as the 1980s. Three decades later, the head start has turned into a sizable lead. China’s electric car armada can be sorted into three groups. They include pure-Chinese startups, such as Xpeng, Nio, and Aiways; legacy manufacturers such as Great Wall Motor, BYD, and SAIC; and formerly European brands acquired by Chinese companies, such as SAIC-backed MG, Daimler’s Smart, Volvo’s Polestar, and Lynk & Co, the last three of which are jointly owned by Hangzhou-based carmaker Zhejiang Geely. Nio, a New York-listed startup from Shanghai with deep pockets, began selling its SUVs in Norway last year. In December, it announced plans to expand to 25 countries by 2025, including Germany, Netherlands, Denmark, and Sweden. The company is also planning a U.S. entry, hiring marketing strategists in San Jose, California, and raising capital through a secondary listing in Hong Kong. Paradoxically, the pandemic has helped the new Chinese entrants. The €1.07 trillion ($1.2 trillion) economic stimulus package, passed by the European Parliament in 2020, included incentives for electric car purchases. Although the subsidies benefited both Chinese startups and traditional European automakers, the Davids and Goliaths, pandemic supply shocks disproportionately hit the latter. “The traditional OEMs in Europe, all of them had a shortage in components and therefore sold less cars than they did before [the pandemic],” Alex Klose, an executive overseeing Aiways’ European expansion, said on the China EVs & More podcast. “There is a space in the market that isn’t fulfilled.” In that space, China sees the chance for an image makeover. While Japan Inc. elicits the image of well-oiled keiretsu lines, China Inc. has long evoked dirty factory floors and the smell of burnt plastic. “If Chinese car brands have no influence in the international arena,” said Wèi Jiànjūn 魏建军, the chairman of Great Wall Motor. “The efforts of the past 20 years will have been squandered.” Liberals talk ceaselessly of China’s efforts to revise the international order, a chess game led by hard-nosed politicians with planes, tanks, and suits. But there is a softer, reputational revision underway, led by ambitious, sometimes zany entrepreneurs with big marketing budgets. Batteries are the key advantages of China EV Inc. In their quest to become household names in the West, Chinese auto manufacturers face an uphill battle. “Chinese products have a history in Europe with regards to cars, which is not the best,” Alex Klose, Aftersales Director of Aiways Europe, told me. For example, In 2006, the automaker Jiangling Motors debuted its new Landwind New Vision at the Frankfurt Auto Show. But their hopes to become a global brand were dashed when a crash test by the German automobile club, ADAC, found that the car disintegrated upon impact. But much has changed in the ensuing decades. For one, the technology tables have turned. “China did not have a domestic automotive industry,” said Russo. “All the core IP [around the internal-combustion engine], it didn’t have ownership of the invention.” Throughout the 80s and 90s, Chinese cars were practically carbon copies of overseas brands. Now, in the electric vehicle era, it is China that holds the intellectual property keys. Batteries are the pillar of China’s competitive advantage. BYD, one of China’s largest battery and carmakers, was one of the first to sell a plug-in hybrid into European markets in 2011. Four years later, the Shenzhen-based manufacturer bested four automakers in a contest to supply electric buses to the Amsterdam Airport. With cost-effective batteries, Chinese EVs are price competitive. Last year, BYD’s flagship EV brand, the Tang EV, sold over a thousand units in Norway, four months after it came to market. BYD outsold Tesla in China last year and Nio and Xpeng ranks ahead of the Volkswagen ID.3 and ID.4, the third and fourth best-selling electric brands in Europe. China is also pushing the frontier of EV software. Today, some of China’s largest tech and internet companies like Huawei, Alibaba, and Baidu provide the digital backbone of China’s electric vehicles. “Smart cars” can identify consumer pain points via big data, or execute software updates like an iPhone. “China EV Inc. staff are dominated by software developers,” said Tu Le, Partner of Sino Auto Insights. Foreign car imports face a 10% tariff in Europe, but China is still price competitive, according to the consultancy firm Jato Dynamics. The cost of new electric cars has nearly halved in China since 2011, while the average price of their European competitors is rising. Legacy brands also face higher overhead costs, so the smaller, nimbler Chinese carmakers might do better in a rapidly evolving industry. “China EV Inc. has a blank slate,” said Le. “They can try new things, dipping their toes with local markets and course correct if some things don’t work.” Chinese companies behind European EV brands Many Chinese brands approach Europe in the leery manner China approached liberalization: crossing the river while feeling for the stones. “They try to do it in a very controlled manner,” said Victor Irle, cofounder of EV-volumes, a global electric vehicle data platform. “Not growing too fast (most likely on purpose) so that they can control the customer experience and collect as much input as possible.” Nio and Xpeng first set up a beachhead in Norway, the most electrified car market in the world. Both have yet to break the one thousand sales mark in cars, yet Norwegian citizens can already find a high-end, 2,150 square-meter Nio showroom in downtown Oslo. The toe-dipping appears to reflect the behaviors of a more experienced industry. Klose, who worked previously at Jaguar, Land Rover, Ford and Volvo before joining Aiways in 2018, says he has learned a thing or two from his Asian predecessors. “We don’t just send cars which don’t fit to European taste or to European driving habits,” he said, referring to past mishaps by Japan and Korean automakers. “If you come to China and say, ‘do you want to have my car?’ How many cars do you want? 500. Okay, we’ll send you 500. That doesn’t work at all.” Cars are an emotional product, and Europeans, for the most part, like to buy local. As a result, Klose fixates on relationships, including cultivating after-sales networks, working closely with importers, and building strong customer service teams. While some Chinese automakers focus on brand, many are already big players in Europe in more subtle ways. Some of the best-selling European brands, like the former British MG, are now Chinese-owned. Meanwhile, European brands are inexorably tied to China. BMW’s iX3 began production in Shenyang and many of Europe’s Tesla Model 3s were imported from its factory in Shanghai. BMW and Volkswagen (as with most Chinese upstarts like Nio, Xpeng, and Aiways) are powered by CATL, the world’s largest battery manufacturer headquartered in Ninde, China. China’s ascent up the global value chain is perhaps most vivid in the electric vehicle space. Here, European consumers are already buying Chinese not for price, but for quality and performance. There are still potential risks. In the past, Europe’s lawmakers imposed quotas on Japanese cars, and Chinese EVs could soon face something similar. Then there’s data privacy: Just as Tesla is beholden to Chinese data security laws, Chinese EVs will be headed for a collision with Europe’s stringent GDPR regulations. But the product speaks for itself. “One of our first customers was a guy who just had seen the car being tested on YouTube and he said, ‘yes, I’ll buy it. I’ve seen the guy testing it, I saw what he did with it and I’m happy, I’ll just buy it,” Klose recounted on a podcast recently. “And by the way, the guy was 70 years old.” Inside the halls of the French parliament, during the summer of 2020, the Chairman of Renault Jean-Dominique Senard, warned French lawmakers of “ferocious competition” coming from the East as Europe remained crippled by the pandemic. “We have to recover quickly to be able to counter these new entrants,” he said. Just across the Mediterranean, on Corsica’s craggy peaks, French vacationers wiled away the pandemic months on their electric Aiways.",
            "summary": "From toys and t-shirts to cars and computers, China is nearing the top of the global value pyramid. Now China’s electric cars are giving premium European brands a run for their money.",
            "url": "https://supchina.com/2022/03/04/why-chinas-electric-vehicles-are-all-over-europe/",
            "image": "https://supchina.com/wp-content/uploads/2022/03/SupChina-57-scaled.jpg",
            "publish_date": "2022-03-04 22:12:35",
            "author": "Alex Santafe",
            "language": "en",
            "source_country": "cn"
        },
        {
            "id": 1996,
            "title": "The state of China's electric vehicle market with Robert Yu – SupChina",
            "text": "Below is a complete transcript of the China Corner Office Podcast with Robert Yu: Chris: Hi, everyone. Thanks so much for joining us today on China Corner Office, a podcast powered by SupChina, the New York based news and information platform that helps the West read China between the lines. I’m Chris Marquis, a professor at the University of Cambridge Judge Business School, and today’s episode features a discussion with auto industry veteran, Robert Yu, focused on the state of the China EV market. Robert has worked 30 plus years in the auto industry. He spent 20 years at Ford and was the Executive Director of GM China, and then most recently, head of manufacturing for EV pioneer NIO. Robert provides an insightful overview of the booming EV market in China, where there are over 450 officially registered companies that have sold about 3 million cars in 2021. And for comparison’s sake, in the U.S., about 800,000 EVs were sold in 2021. One of the interesting features of the China EV market is how wide the price points are, and we discuss which market segments and makes are doing well these days. For instance, at the low end, SAIC-GM- Wuling produce a Mini EV, which since 2020 has sold hundreds of thousands of units with a starting price of just over $4,000. Another segment with tremendous potential is the mid-market where NIO and XPeng have no significant competitors worldwide as much of the EV companies outside of China, like Tesla, produce higher end offerings. These firms have just started to enter the EU market and it is likely their influence will spread throughout the world. We also discussed auto manufacturing processes in China; from Tesla’s Gigafactory in Shanghai to the unique manufacturing infrastructure at NIO, where Robert headed manufacturing. NIO is actually pioneering an outsourced manufacturing model like Apple with its iPhones. Apple designs its products, for instance, in California, and then outsources production, for instance, to Foxconn. NIO has partnered with Jianghua Automotive Corporation, JAC, who has built an assembly plant for NIO in Hefei. We discussed the pros and cons of this outsourced model and its potential to spread to other automakers. Thanks so much for listening and please enjoy the show. Chris: Robert, welcome to China Corner Office. Robert: Hi, Chris. It’s great to be here. Chris: Great. Well, we’re really excited to learn more about the EV market in China. I’ve been reading so much about the explosion of EV companies, fast growth of the EV car market, it’d be great to just learn a little bit about this market. Can you describe the current position of the market and what the ecosystem is like? Robert: I’ll be happy to, Chris. The Chinese EV market, certainly I think everybody have heard a lot about in the last few years, very dynamic. The volume has grew tremendously. I think this past year the EV volume in China, the sales was a little bit over 3 million units, that’s compared to the U.S. at around 600,000 units, I believe. And it’s growing basically triple digits really in the last five years, exceeding expectations even within China. And there are quite a few players in the Chinese market. The number of automakers specifically producing EV, it’s quite amazing that there are around 450 registered EV automakers. I’m aware of over a 100 of them that’s actually active and produce some sort of a product. So it’s very, very dynamic. The best sellers changes year over year. Everybody introducing new models literally very quickly and I think that trend is certainly continuing. Chris: Wow. That’s like 450 registered companies. That’s absolutely amazing. Any sort of trends around that? I know China had a very active e-bike industry with, like, I think hundreds of millions of e-bikes, there’s other established automakers. Who are the players that are getting into this market? Robert: That’s actually a very interesting question. And certainly my knowledge is not going to be all encompassing, but you have traditional automakers, of course, globally, and certainly there are no shortage of startups in China. You may have heard of NIO, Xpeng, Li Auto, there are many others. Pretty well any traditional automakers that’s strong enough, if you will, technically and has the resources are getting in there. And then there are really a tremendous number of startup. They are just people with ambitions, people with technology getting in. The three I mentioned are very typical ones and people know about because they IPOed in the United States. But there are quite a swath of EV entrants that are, as an example, EV bike manufacturer, and they’re pretty spread out throughout China. There’s also a few battery makers that I’m aware of, they are people that actually used to make motors. So it’s actually a very broad set of entrants coming in, and geographically quite diverse as well throughout China. Chris: Very interesting that diversity. Are there any hotspots geographically? I know like Shenzhen, BYD was an early player there. Are some other regions, like around Beijing or Shanghai or in the West somewhere? Robert: Well, I think the traditional major cities in China, such as Beijing, Shanghai, Guangzhou, Shenzhen, there is actually clusters of these hotbeds for innovative companies, startups. Currently EV is certainly growing very rapidly around those large cities. However, there are also other clusters more inland. There are several companies around Wuhan I’m aware of, and I heard there are companies in Xi’an. These are central China cities. I wouldn’t be surprised that there are actually quite a few around what we normally refer to as tier three cities. For example, I know a couple in Suzhou, China, and I know there are at least one near Nanchang. So it’s actually surprisingly pretty spread out geographically, right down to at least tier three cities. Chris: Wow. That’s surprising. Well, I guess with so many of them it makes sense that they are spread out a bit. You mentioned a number of market leaders like NIO, Xpeng, what can you say about their position. Is there in some ways a top tier that those firms and maybe some other ones that people might not be familiar with? How would you think about sort of who the real important EV companies to know about are? Robert: Right. Certainly there are various ways of looking at, if you like, to say tiers or segmentations. If we use North American or European market or so called mature market as a reflection and correlate with their segmentation, NIO, and Xpeng, and LI are not just well known IPOed in the United States but they are also essentially targeted throughout the premium segment, or I should say they are more focused because they do have products that are slightly segmented. These three companies are very visible and they target towards products that’s around, let’s say, $40,000 U.S. to about $80,000 U.S.. So in the U.S. there will be like upper segment, or you can call them premium segment. Robert: Within China there’s actually several other EV automakers that certainly have the ambitions and have produced products in the same segment or higher, but China actually because the volume, it is a 25 million to 30 million per year car market, so with that volume it’s segmented more. So in addition to the three well-known; the NIO, Xpeng, LI Auto for the premium market, there’s quite a few others that… I’m sure there are more than what I actually know. And then there’s really several tiers of automakers we are product-focusing on different pricing segments below that, and that actually is a much bigger volume than most people realize. Chris: So you mentioned a potential market of 24 or 25, that’s the annual auto sales in China? Robert: That is the annual passenger vehicle. Chris: Oh, passenger vehicle. Robert: So if you include a commercial vehicle it would be well over 30 million. Right now I think we’re focusing on the passenger vehicle segments. So yes, in China this past year is 25 million. I think China actually reached, I believe it’s 29 million, approximately several years ago, before the economy got a little bit more challenging, the international relationship. So yeah, very large markets. Chris: How many of those are EVs? Robert: I believe this past year the retail market in China for EVs is a little over 3 million. It’s around 15% of the market already. So literally in about three years, they went from about 2% or something like that. Low hundreds of thousands of EVs in about three to four years, now they are over 3 million, and around 14%, 15% of the passenger vehicle market. Chris: How does that compare to other major markets? Do you have any idea in the U.S. or EU? Do you have those numbers off the top of your… Robert: I would not be able to remember all the specific number but I can give you sort of the range. U.S., as an example, last year sold around 600,000 in total. Actually it’s one of the highest growth year. U.S. essentially started selling EVs actually ahead. So your word, there’s actually other company other than Tesla that have put out EVs before. So if I used roughly this past 10 years, essentially the EV market went from hundreds type units to now 600,000 in about 10 years. In China, basically there were probably EV products being introduced maybe as early as seven, eight years ago. There may be some earlier but the ones I’m aware of maybe first started about seven years ago. So in about seven years in China it grew from hundreds, if you will, to over 3 million. So you can see the growth rate, it’s rather incomparable when you look at numbers strictly. Chris: Wow. I’d be interested to hear a little more about the different segments. I know in the U.S. Tesla, sort of the price wise at least it started out as a very premium brand. I think even more expensive than some of the NIO and Xpeng that you mentioned, they are selling $40,000, $50,000 U.S.. In China, I know Tesla has opened this Gigafactory in Shanghai. Where would you put Tesla’s competitors in China? And then also interested to hear a little bit about the lower price. Is there a segment of cars lower price than NIO and XPeng that are being sold? Robert: Yes, no, that really it’s a very interesting and salient point. Tesla in the U.S. is clearly premium. Certainly it has a lot of cache, a lot of brand recognition, not just technology but pricing. In China, that segment, identical pricing exists, so for the income level of Chinese, that’s actually even a higher segment if you actually look at the buyer’s income to the vehicle price. So if we call that premium, in China, because the volume, they are several tiers, just to give you an example. I guess we can look at it this way. In China, the two highest volume vehicle EVs, it’s actually not the Tesla segment, it’s not the NIO segment, it’s not the XPeng segment, the top selling vehicle it’s actually SGMW, sometime called Wuling. And that vehicle EV it’s around $6,000 U.S. and it sells about 50,000 units a month. I think this last year they sold around 400,000 units, and that’s a $6,000 to $7,000 EV. And I believe the second highest selling vehicle is the BYD Qin, and that vehicle it’s around $28,000 to $35,000 U.S. approximately. So that actually it’s essentially two vehicle pricing segment below. Certainly the Model 3 is a model of Tesla. And there’s actually more segmentation going down. So if you look at China and you look at the top selling vehicle, you will see much more volume below the Tesla, the NIO ES8, the Model Y, that segment. So the example I’m giving you, the SGMW Mini, $6,000 equivalent. So you can see the pricing from about a $100,000 per vehicle literally go all the way down. I’m actually aware there are EVs that’s selling for about $4,000. And there’s lots of volume actually between about $25,000 to about $35,000. That range, there’s several models that sell well over a 100,000 units a year. Hopefully that gives you a feel of the segment and the volume in China for EVs. Chris: Yes. Super interesting. I’m wondering, with all that diversity, is there any standardization on the plugging, ways to plug in the EV? I’ve heard some in the U.S.. You know, Ford was just introducing a truck and I think there’s issues where they can’t plug into the Tesla because they don’t want to pay, I guess, some licensing fees and so maybe they setting up their own infrastructures. How is that playing out in China as far as the charging infrastructure and sort of adaptability of the ways that cars charge themselves? Robert: Yes. I think that is an evolving standard I think worldwide. However, in China, the government is very active in setting the standard. So the Chinese government has already set a pretty specific standard for volume EVs. Essentially, probably greater than 90% of the electric charging polls or charging stations throughout China all have that standard, and most automakers when they produce EVs, design EVs, they also use that standard. But there are various automakers who they want higher performance, they want their technology to be adopted, they believe their technologies are more advantageous to other, and certainly Tesla is the best example. Tesla, they do have their super charging network and Tesla has their own standard that they would like as many people to adopt as possible. But in China, the different standard it is still an issue but it’s lesser of an issue compared to, if you like, the United States and Europe. Over time each continent has essentially sort of like, you can say, top one or two standards emerging, while in China you clearly have the government standard emerging as the top. Europe has their own. There’s really almost no difficulties to find the charging poll where your plug will physically fit and allow you to charge. Certainly, I will say, tier one, tier two city, it’s pretty well almost there. Tier three cities and below it’s different and you still see different automakers, whoever was there, they are the earlier versions. Chris: Really interesting. I guess it doesn’t surprise me but very interesting thing to think about sort of how that actually helps the Chinese market grow. And for consumers, if there’s a lot of charging infrastructure, it makes it a lot more easy decision. Is there any government subsidies or sort of benefits to consumers for buying EV? Robert: Yes, certainly Chinese government with this whole EV industry, this market, they are actually quite active and proactive. So the Chinese government’s heavily involved. They certainly has put a lot of incentive to help develop the industry, to develop the market, the consumer acceptance, setting standards, and all of that. And they have continued with the incentive, although pretty well all the consumer based incentive are phasing out. The government actually tried, at least I can remember two other times in this past five years, to turn off the incentive. They turned it off and then they turn it back on, but they are currently seem to be very committed and the incentive is phasing out, There are several different incentive and there are still some provincial incentive but largely the incentive will be phased out in the next couple of years. The producer incentive actually has already evolved into somewhat of a mirror-based and long-term planning type. It’s not really available to anybody that wishes it anymore. So that is phasing out as well. That one I do not know the timing but I know the classification. The measurement to give producers incentive, it’s much more stringent, and that is phasing down as well. Chris: Great. Would like to learn a little bit now about your role at NIO. I know you were relatively early in the company’s history the head of manufacturing, which was done in a really unique way compared to the auto industry overall. Can you describe your role at NIO a bit and what their approach to manufacturing was, or is? Robert: Yes. I was the head of strategic manufacturing program. We internally referred it to as the campus program. I was responsible in setting up NIO’s internal manufacturing, and that is because NIO entered the market leveraging the strategy of outsourced assembly of its vehicles. In fact, NIO currently all the products still come out of their partnership program with Jianghuai Automotive, also known as JAC. So NIO does not manufacture its own products. It does pretty well everything else, but the manufacturing engineering, the facility and all that, it’s actually entrusted to its partner. That model is somewhat similar to Apple iPhone, or iPad or Apple laptop, if you will. Apple, pretty well, does not produce most of its products, actually, they are produced by various companies. Typically people hear about Foxconn Electronics. So NIO use that model. It’s a light asset model and it leverages partners with more manufacturing expertise to themselves. I think it was a good way to start. And I was responsible to design, develop structure, organize NIO’s own manufacturing which is now underway. Chris: Okay, got it. That’s really interesting. I mean, obviously I’ve heard about Apple’s work in the supply chain, which is really innovative, but I don’t know many or any other car companies that do this, and it seems that car sort of factories are sort of much more specialized and sort of specific to the type of car than maybe a cell phone or something like that. Can you say a little bit more about maybe how widespread this is in the industry and how they came up with, or how they found their first partner to do this? Robert: Certainly. Actually it is quite rare in the automotive industry to have a different company assemble or produce your product. And you’re absolutely right, cars or automotive products generally have a lot of complexity. There’s a lot of, not just the traditional precision, there’s fit and finishes. There are products you actually have to sort of feel it and look at it. So it may not be as precise as a electronic product but actually it has many, many quality implications and technology implications, therefore… And the parts sometime are very expensive and large, so it’s very, very rare. But it’s actually not something that only happened recently. Magna, for example, has produced vehicle in Austria for Mercedes, BMW, Chrysler probably as early as about 25 years ago. The Graz plant actually, I think roughly that’s when it started. So it’s few, it’s rare but it has been in existence. In the long run it’s generally not the method that most strategic automaker will go under. There are just a lot of things that needs to be controlled. And as you introduce new product, they are just fixed investment that you cannot avoid, and continuing to have this done by another company, it’s questionable what you get and what you give. So I think most automaker will continue on using that model. Although I will see, I think, maybe more startups, and certainly in the EV arena, having outside company manufacture the vehicle. I think we will see more of that. Chris: That makes a lot of sense. As you get started maybe you don’t have to have the capital or even the expertise. If there’s companies that have this expertise already, it’s actually a real simple way to ramp up your production a lot easier. Robert: Right. Right. And also if there are products that go through changes a little bit more frequently or lesser volume, it actually does make sense in certain business cases. Chris: You mentioned this JAC company, are they working with other automakers as well or other companies in China pursuing this same strategy? Robert: Yes, JAC actually has a partnership with Mercedes. My apologies, I think it’s actually Volkswagen. My apologies. JAC on its own actually has another specifically EV joint venture going on. Most recently I heard that they are talking about maybe changing the ownership structure a little bit, but it’s an ongoing program. And JAC has actually done some other program for local car companies too. So it’s a company that has a little bit of experience in that, and they were open to partnership with NIO, as an example, but they certainly… It’s not excluding pursuing this type of model. And certainly the partnership structure is something they seem to be open to. And they are quite competitive in general on a cost value basis as an automaker. Chris: You mentioned about 450 registered auto companies, maybe 100-150 or so I think you said are active. I’m not sure if you have a sense, how many of those are actually trying to build their own factories and facilities versus do some sort of outsourcing model like this? Robert: It’s difficult to talk about the numbers. What I can describe is that the one that I came across and have some knowledge, most of them are building their own plants. I’m actually only aware of few that is actually going toward the contract bill model. And even out of that, just to give you an example, I mean, XPeng started that way as well but they literally started to think about their own plant and their own cooperation very, very shortly after they started kicking off the program. For example, early days, they had their products produced by Haima, which is a car company on the Island of Hainan, but they very, very early on started to plan out their own manufacturing facility. I think they are actually building their second one already. So I know some that’s pursuing the outside construction model. I’m aware a couple of EV makers in North America that’s doing the same, but I think in general they are a smaller portion compared to automakers pursuing their own manufacturing operations. Chris: Interesting. Wow. Another sort of topic that I’m very interested to talk to you about is, these companies have been very successful within China and I’ve read that some of them are going to potentially start entering the European market. Like Norway, for instance, I just read that huge percentage of their car sales are EVs these days. Obviously Norway is not a very large country so I don’t think the overall numbers are too huge. However, I’m wondering about… I think I read that some Chinese companies are going to enter Norway. What’s your sense of how the Chinese companies are going to start expanding to other markets like Europe or the U.S.? Robert: I think that certainly it’s just a matter of time. Several EV automakers have already entered, as example you give Norway. There’s actually several European nations they at least have begun the process pretty far down the road to allow various Chinese automakers to start exporting EVs to their country. I think, other than Norway, I believe Finland and Denmark, they may have even already begun importing EVs into them. So it’s beyond Norway already. NIO and XPeng, both of them, are in at least two countries. They both are at least in Norway. I don’t quite remember exactly what’s the second market they are into, so they already in there. But what’s interesting is, actually there are several other EV automakers in China that are already in various countries in Europe. BYD, Shanghai Automotive, and GD, through their different brands, they actually have exported EVs to several European countries. They are in smaller volume. They are lower profile. I think they are experimenting with the market a little bit, learning about it, and they are waiting for their product portfolio to gather up. So I think for most of the EV automakers, they would like to be as global as possible. Europe is a good place to start, but they have quietly started in several other countries other than Norway already. And some of the Chinese automakers such as China Motors, SAIC, which is Shanghai Automotive, they also have exported products in some of the countries in Asia. So I think if the geopolitical tension and the trade concerns with U.S. did not happen, we probably would have seen a few brands of Chinese EVs reaching in the United States as well. Chris: So interesting. And I’m curious, them entering the European market… My experience most of my life has been in the U.S., usually Asian companies come in with value based products in sort of maybe sometimes a lower price segment. Is that where they are targeting in Europe? I mean, it seems like with the breadth of the products that exist in China there’s a variety of different positions they could take. Robert: My understanding, my observation is that in Europe, most of the Chinese EV makers are targeting, or are at least starting with a higher segment as well. Both XPeng and NIO, as well as SAIC, they are putting out the higher priced product into Europe. And that makes sense. It is new technology. The lower priced vehicles the technology tend to be slightly less competitive. And I think for European markets that makes sense. At the end of the day, volume is a big deal on how to make profit in the automotive market. In the U.S., if you look at the EV, it’s evolving the same way. I think most of the Chinese automaker, if they come through the United States or North America, it’ll be somewhat similar, but I think the longer term ambition certainly is not limited to premium vehicles. I’m aware of several of the major EV automakers. They are really coming down one segment at a time introducing new products at the lower price positioning points and larger volumes. That is just happening. I think it’s a good strategy. So Europe will see more of that lower priced product in some progressive manner. In Asia it’s a little different. Asia seems to be more encompassing in terms of the varieties of the price of the EVs. And certainly right now that’s a smaller market, and I think to some extent there’s some experimentation going on there. The U.S. is working actually very similar. It’s a mature market. U.S. is actually very unique, but if you think about Tesla being the very clear success example, they actually started with a high end vehicle as well and they are working themselves down, both in terms of size and price point. So I think that all makes sense. Chris: Yeah, that’s really interesting. Given your earlier comments I would have maybe predicted they would try to enter with more of a value play in some ways, but it’ll be interesting to see how they do in the higher price segment too. Given what you said about being sort of the advanced technology, that certainly makes sense. And I think that for the longest time, as you know, Korean companies expanded around the globe, Japanese companies obviously expanded around the globe earlier. There weren’t that many Chinese companies that were seen as brands that people really wanted and this might actually be sort of a turning point in that of Chinese brands, so really interesting. Robert: Yeah, actually, Chris, I think that’s a very keen observation. With the traditional products, the so-called ICE, internal combustion engine products, I think customers over time, and knowing the product, growing up with the product, they know very well the level of technology, the level of quality, the reliability, the durability. EV it’s essentially a new technology coming in. And so Chinese coming in as a automaker in this overall landscape, it’s somewhat even footed, even basis, as comparisons for the actual product. So there isn’t a lot of inherent disadvantage, I think, and I think the Chinese EV automakers entrepreneurs seize the opportunity to do this. I think there’s still a perception difference. I think people will recognize Tesla has the edge and so on and so forth, it’s most advanced, but the gap is much, much smaller and the value proposition it’s also closer and easier to manage. So I think that’s something I think you very keenly observed, and I think that is going on and they are taking advantage of this and has sort of shortened the gap of brand recognition and brand building. Chris: I’m really curious to see how that plays out. I think that’s really going to be interesting not just the global sort of ecosystem of auto manufacturing changes but then sort of the role of China as a leader in that. It will be really interesting to observe. I’m interested as well… You mentioned the internal combustion engine cars, and I know a lot of your background actually you had sort of decades of experience at both GM and Ford, and I’d like to hear a little bit about your experience there. I know some of it was in China. One of the things that always surprised me in the time I spent in China was that the manufacturing in China, the amazing factories in Southern China that are producing electronics, you know the iPhones, some of the most state of the art electronics are produced in China, but it seemed a real struggle to actually produce really high quality cars, at least of the Chinese brands. I might be off on that a bit, but it seems that they are taking this opportunity with the EVs in some ways to leapfrog the internal combustion engine technology, which from what I understand, actually it’s harder to make internal combustion engines cars than EVs, and so it makes a lot of sense to really forget about that older technology. Robert: Yes. Certainly I have spent more than 30 years in this industry now. 20 years with Ford, a few years with GM, and then the rest of the time I spent managing automotive companies in China. And I will say, the first 20 years of my career, things were relatively predictable and the competition is actually quite fierce, and technology and quality performance were moving quite fast, but in comparison, nothing like what has happened in the last 10 years. I spent the last 15 years mostly in China and I saw the evolution and the revolution firsthand. And in China it’s actually quite amazing because seeing things from basically zero to one, started with a white piece of paper and then seeing things develop around the Shanghai or the Yangtze delta area in terms of EVs. Very early days I had the opportunity to see what’s in Shanghai, in Nanjing, which is also a big area of EV automakers, and then Guangzhou, and Shenzhen. And then up in the north around the Yellow River delta, the Bohai Delta, I guess sometime it’s called, which is Beijing, Tianjin those kind of area. I saw these little companies grow up in a very challenging environment, and then quite a few of them succeeded, or maybe at this stage you say, well, have to have survived the initial test, and they are now producing some pretty amazing products. So the growth in the capabilities is actually amazing, both in terms of speed and quantity, and the level of capability and capacity. So in China there isn’t just one area, as I mentioned, there are several areas with multiple EV makers; battery makers, electric motor manufacturer. And the internal combustion engine, I guess it would be premature to say it’s not a focus, but certainly the money, the expectations are all in EVs. And the Chinese automotive industry I think as a whole has taken that leap into EVs. So internal combustion engine is something that really it’s a reality, it’s still there, you know, for heavier loads and things like that. For currently lower costs it’s still there and will continue to be there for quite a while, but the percentage of EVs, the number of EVs in all segments, including commercial, including heavier capacity, that is already in some special purpose vehicle, commercial vehicle already see the beginning, or you can say, momentum starting. There are just a whole bunch of thing going on. And a lot of the barriers were internal combustion engines that 10 years ago these Chinese automakers were working on, they are literally just keeping it run. They are no longer putting the R&D dollars in there. They no longer updating their manufacturing facility. They are putting their focus on the new technology. And certainly at this point it look like we’re pretty well at the tipping point. It tipped in China, now it’s ready to tip globally. Chris: I’d like to hear what’s your sense of these incumbents that were maybe not international standard level internal combustion engine makers are now sort of shifting to EVs and you have sort of new companies like NIO, XPeng. How do you feel about the competition between those? I know in the U.S., GM had a EV I think it was in the 1980s, but really there’s studies sort of when you have commitment to one technology, it’s really, really hard to introduce some new disruptive technology, so you need new entrants to come in, like Tesla, to really sort of shake things up. That’s happened in many industries. In China, do you think maybe the incumbents are going to be able to make that shift in a more, I don’t know, quick way, maybe because the government has placed some emphasis on it? I’m curious what your thoughts are of legacy incumbents versus newly founded firms. Robert: That’s going to be an interesting situation that remains to be played out. My personal opinion is that there are going to be winners and losers. I see certain traditional automakers in China, I see they were sort of left behind but then in the last three years they really put a lot of effort and they are catching up rapidly. In my mind one of the best success example is actually BYD. Most people don’t realize BYD have been building traditional vehicles, they still do right now, but they were actually a completely internal combustion engine manufacturer for over 10 years now. Of course they have electronics and electrical DNA in their competency. So they were one of the earlier people that went inside, but they didn’t put all sorts of money in there initially, they sort of took a steady approach. So they are an example that a successful switch because of the DNA. But then you also look at Shanghai Automotive. SGMW is partially owned. I believe Shanghai Automotive owns around 30% and I think GM owns around a little over 30%. They are roughly equal ownership. They are the two big stakeholder of SGMW, Shanghai Motor Wuling. I believe that’s sort of the structure. That’s a company that people kind of didn’t give them a lot of chance. State-owned company, they didn’t seem to put a lot of effort in it, they are too slow, but Shanghai Automotive and SGMW, I think collectively they sold around 500,000 or 600,000 EVs last year. Obviously there’s a big part, 400,000 is the SGMW Mini, but Shanghai Automotive themselves sold around 200,000 EVs. You don’t hear about it. And they have a slew of new EVs coming out. So I think all of the traditional ICE automakers… Basically you got two groups. You got the state-owned group, much more massive. They are slower. And I think there are going to be some of them that certainly not going to do well because they clearly are too slow and they haven’t built up sufficient technical competency to go in there. Now that doesn’t mean that they won’t survive but they certainly have lost on getting onto first base. But there are several others such as SAIC, such as Guangzhou Automotive, they have put a lot of effort. Guangzhou Automotive sold I think around 200,000 EVs also last year. So there’s a few SOE, state-owned enterprise, automakers, large, a bit slow, but they sort of woke up. They are now getting onto first base. I will say a larger portion of them are struggling, the large ones. FAW seems to be just having problem getting good EV product introduced and so on and so forth. And then there’s the other group of traditional ICE automaker that are privately owned, and out of those I see some players that clearly they will succeed as well. They are just not getting as much limelight. And then there are others that it’s questionable, in my opinion at least. You know, Great Wall, it’s a joint venture of BMW by the way, they’ve been selling the ORA Cat, and it’s just recently introduced. I think it was only introduced about a year ago. Last time I looked at their stats I think they already sold like almost 70,000 of those products. Geely as an example, their brand is a little bit more fractured, but I think collectively Geely they sold around 300,000 EVs too. They are under Lynk & Co. brand. They are under Zeekr brands. They are under GD brands. So I think there are going to be winners and losers, and certainly the ability to actually develop the product, which means sufficient competency in the technology area, as well as actually marketing and selling a proper electric vehicle, because at the end of the day, it’s still the second largest purchase for most people. And to produce a product they want, not simply because it runs on batteries or electricity. There’s still a art and science to that. So I think basically in the next year or two, I think there’s going to be some pretty major shakeouts. The 450, 460 companies, I think in the next year or two, it will probably be about one third of them that survives, and there’s probably going to be, I’m going to guess, maybe 30 active players, and then you go through some additional attritions going through that. It doesn’t have a very clear pattern of just categorizing; if they stay on, they will succeed, if it’s large traditional, they won’t succeed. It really has a lot to do I think with the leadership, with the ability to build competency. Still have that core competency of knowing what the customer want and how to produce a product that’s now both technologically and value wise what the customer wants. Chris: Great. Well, I think with that you gave sort of a really interesting sort of landscape view of what’s going to likely happen with the next few years. That was actually what my next question was, so I think we’ve come to conclusion. Robert, really so much appreciate you taking the time to talk with us today on China Corner Office. Robert: Oh, it’s wonderful. I really appreciate, Chris, you inviting me to this discussion. Thank you. Chris: Great. Thank you.",
            "summary": "Auto industry veteran Robert Yu talks about the booming EV market in China, which sold a total of about 3 million cars in 2021, compared to the 800,000 EVs sold in the U.S. the same year. He speaks to Chris about the current market, and how firms like NIO and Xpeng are exceptionally well-positioned around the globe, and have recently begun entering into the European market.",
            "url": "https://supchina.com/2022/03/11/the-state-of-chinas-electric-vehicle-market-with-robert-yu/",
            "image": "https://supchina.com/wp-content/uploads/2022/03/NIO.jpeg",
            "publish_date": "2022-03-11 16:05:17",
            "author": "Chris Marquis",
            "language": "en",
            "source_country": "cn"
        },
        {
            "id": 2058,
            "title": "Electric car brand NIO wants to make smartphones – SupChina",
            "text": "Shanghai-based electric car brand NIO is hoping to build smartphones, according to leaks over the past few days on social media and the tech blog 36kr. The news comes as the barriers between smartphones and smart devices — like the electric vehicle — continue to erode. The smartphone arm of NIO will be based in Shenzhen and led by the former president of the phone company Meitu, Yǐn Shuǐjūn 尹水军. NIO responded to the rumors yesterday, claiming that no information can be disclosed at the time. However, online job postings in smartphone engineering positions confirmed the intention. NIO will be entering a cutthroat market dominated by companies like Apple, Huawei, and Xiaomi. The context: This is not the first time NIO has entered a new field. The startup has diversified into a number of related — and sometimes unrelated — sectors. They include building batteries, real estate, furniture, apparel, and more. Meanwhile, phone companies have already made forays into the EV business. Early last year, ambitious smartphone companies like Apple, Huawei, and Xiaomi announced their plans to develop electric vehicles. In April, Huawei revealed the Seres SF5, which can be hooked up to Huawei smartphones, allowing for remote control and data transfers. ​​Xiaomi has set 2024 as the date to launch its first vehicle model. NIO is not the only carmaker with smartphone ambitions. The automaker Geely launched its own smartphone business back in September by establishing a Wuhan-based headquarters. In the U.S., Tesla has long been rumored to launch a phone. The takeaway: China’s smartphone makers are increasingly turning from collaborators to competitors. Smartphones are an essential component of the future smart car, and China’s EV startups may be pressured to offer their own solutions. It might not be a big leap: Whether phones or cars, smart devices all share similar base technologies such as chips, software, AI, integrated devices, and new manufacturing capabilities.",
            "summary": "EV maker NIO wants to build smartphones, adding to a list of tech companies that are blurring the divide between smart devices for talking and traveling.",
            "url": "https://supchina.com/2022/02/23/electric-car-brand-nio-wants-to-make-smartphones/",
            "image": "https://supchina.com/wp-content/uploads/2022/02/NIO.jpg",
            "publish_date": "2022-02-23 15:10:29",
            "author": "Chang Che",
            "language": "en",
            "source_country": "cn"
        },
        {
            "id": 3050,
            "title": "Will global supply chain woes end soon?",
            "text": "As the much-awaited recovery period entered the world economy in 2022, when global vaccination had reached an optimum stage and overall demand had lifted, prices shot high because of restricted supply. The pandemic took a heavy toll on the world supply chain because of stringent lockdown restrictions across the globe. However, as Covid-19 cases started settling down, people became hopeful that the supply chain barriers would soothe. But is the world really in a state when the global supply chain woes would end? Let’s decode! TITLE-How can efficient supply chain management system become a game-changer for business? Apart from the pandemic, geopolitical issues have joined the rally behind supply chain woes. The International Monetary Fund had earlier stated that the world economy would grow at 4.9% in 2022; however, a few days back, the organisation downgraded their forecast to 4.4% and supply chain woes are one of the main factors for this downgrade. The global supply chain market has been hindered because of the restricted supply of raw materials and essentials due to strict Covid-19 rules. In many countries, the restrictions have settled down; however, port closure is a big obstacle in a fluent supply chain in countries like China. ALSO READ: Why is the crypto industry getting sucked into the Russia-Ukraine war? Source: © Florinseitan | Megapixl.com China is a significant exporter of cotton, and because of its restricted supply from pandemic and labour-oriented reasons, clothing is getting expensive. Additionally, because of the recent Russia and Ukraine crisis, the price level for wheat, corn, and oil are skyrocketing as Russia, and to an extent, Ukraine is a significant exporter of these commodities. Additionally, Ukraine also exports essential gases needed for chips, especially the USA. Thus, a hindrance in the same would cause shortages for semiconductors required for home appliances manufacturing. The demand for electric cars is rising in the west; however, a few days back, Tesla announced that the sales could be hurt due to obstacles in the supply chain. MUST-READ: Ukraine-Russia crisis: Why are Aussie funds cutting down investments in Russia? As Russia invaded Ukraine and the talks between Russia and Western allies didn’t reach a peaceful resolution, the airspace closure followed by the talks between Russia, UK and USA has further expounded the global supply-chain woes. Now, flights between Europe and North Asia are most affected. Unfortunately, the airlines that are responsible for moving around 20% of the world’s air cargo are facing difficulties because of airspace closure. GOOD SECTION: Russia-Ukraine war: How the West is using economic sanctions to punish Moscow Just like it could take months to restore to the old normal life, people wonder if reviving the old supply-chain networks would be equally difficult. Several economists have said that the supply chain wouldn’t get fluent in 2022. It would take better investment, refashioned incentives, technological innovation and most importantly, world peace for the supply chain woes to end soon.",
            "summary": "<blockquote>\n<h2><strong>Highlights</strong></h2>\n<ul>\n<li>China is a significant exporter of cotton<strong>,</strong> and because of its restricted supply from pandemic and labour-oriented reasons, clothing is getting expensive.</li>\n<li>Due to the Russia and Ukraine crisis, the price level for wheat, corn, and oil<strong> </strong>are skyrocketing as Russia, and to an extent, Ukraine is a significant exporter of these commodities.</li>\n<li>The demand for<strong> </strong>electric cars is rising in the west; however, a few days back, Tesla announced that the sales could be hurt due to obstacles in the supply chain.</li>\n<li>The airspace closure ensuing talks between Russia, UK and USA has further expounded the global supply-chain woes.</li>\n</ul>\n</blockquote>\n<p><em>As the much-awaited recovery period entered the world economy in 2022, when global vaccination had reached an optimum stage and overall demand had lifted, prices shot high because of restricted supply. The pandemic took a heavy toll on the world",
            "url": "https://kalkinemedia.com/news/economy/will-global-supply-chain-woes-end-soon",
            "image": "https://cdn.kalkinemedia.com/image/c9b74e4b64a24834b2861ce4ef2992c9/image.jpg",
            "publish_date": "2022-03-12 14:49:52",
            "author": "Toshiva Jain",
            "language": "en",
            "source_country": "au"
        },
        {
            "id": 3080,
            "title": "Elon Musk ships new technology to Ukraine, Mykhailo Fedovor thanks him",
            "text": "Elon Musk, the world’s richest man, has kept his promise, as Mykhailo Fedovor, vice prime minister of Ukraine, tweeted that Ukraine has received the second shipment of new technology, worth millions of dollars today (10 March 2022). The embattled country received Starlink Rapid Deployment kits from the SpaceX boss for assisting in emergency communication. Through Twitter, Ukraine’s leaders have expressed their gratitude. Volodymyr Zelensky (president of Ukraine) also thanked Musk for extending support to Ukraine. Musk responded a few hours later and highlighted that the company has also sent power adaptors that can be used for solar/battery packs, car cigarette lighters and generators for places where the electricity supply is not available. Suggested reading: Following global peers, ASX 200 closes 1% higher Musk has also warned that Russia can target Starlink services as it is the only non-Russian communication service that is active in the country. Therefore, he suggested that the devices should be hidden with the help of ‘light camouflage’. How has Musk helped Ukraine? Minister of digital transformation and vice prime minister Mykhailo had requested Musk to start Starlink’s services in the country to provide relief to the citizens amid armed conflict with Russia. A day after the request, Tesla's CEO announced Starlink’s satellite-broadband services had been activated. The technology offers internet services to the war-torn nation directly from its satellite, orbiting around the earth. The satellite technology can extend internet services even in those places where cell towers and fiber optic cables cannot reach. Image source: © Syanawut | Megapixl.com Tesla employees also played a significant role in bringing satellite internet services to the country as the energy team provided Tesla Powerwalls required to run Starlink equipment. Tesla’s certified installers donated charging cables and investors, and Tesla employees employed them to assemble the Powerwall systems. As per a media report, Musk has also announced that his company, Tesla, would pay its Ukrainian employees for three months if they fight in the war for their country. The offer was made through mail circulated amongst the employees in Africa, Middle East and Europe on 9 March 2022. However, the email does not clarify whether the benefit would be extended to North American employees and somewhere else. Since Tesla does not operate in Ukraine, it offered free supercharging services to the 5000 Tesla drivers of Ukraine at stations located in Slovakia, Hungary, and Poland. Do watch: Australia Declares East Coast Floods A National Emergency Musk offers help to Australia Ukraine-Russia crisis is not the first time that Musk has offered billion-dollar help. Australian professional surfer, Mick Fanning had asked for Musk’s help with the northern NSW and Queensland floods. Fanning tweeted, Related article: New South Wales floods: PM Morrison may declare ‘national emergency’ On 9 March 2022, Northern NSW received over 10 Starlink kits, which cost around $10,000 each. Last year, Starlink partnered with NetVault, a telecommunications provider which is reportedly delivering technology to affected areas in NSW and Queensland.",
            "summary": "<blockquote>\n<h2>Highlights&nbsp;</h2>\n<ul>\n<li>Mykhailo Fedovor, vice prime minister of Ukraine, has thanked Elon Musk, as Ukraine has received second shipment of Starlink Rapid Deployment kits.</li>\n<li>Starlink Rapid Deployment kits assist in emergency communication.</li>\n<li>Northern NSW has received over 10 Starlink kits, which cost around $10,000 each after Australian surfer, Mick Fanning asked for help.</li>\n</ul>\n<p>&nbsp;</p>\n</blockquote>\n<p>Elon Musk, the world&rsquo;s richest man, has kept his promise, as Mykhailo Fedovor, vice prime minister of Ukraine, tweeted that Ukraine has received the second shipment of new technology, worth millions of dollars today (10 March 2022).</p>\n<p>The embattled country received Starlink Rapid Deployment kits from the SpaceX boss for assisting in emergency communication. Through Twitter, Ukraine&rsquo;s leaders have expressed their gratitude. Volodymyr Zelensky (president of Ukraine) also thanked Musk for extending support to Ukraine. Musk responded a few hours lat",
            "url": "https://kalkinemedia.com/news/world-news/elon-musk-ships-new-technology-to-ukraine-mykhailo-fedovor-thanks-him",
            "image": "https://cdn.kalkinemedia.com/image/e196f602a04e483593604f5045eef70f/image.jpg",
            "publish_date": "2022-03-10 09:18:36",
            "author": "Sonal Goyal",
            "language": "en",
            "source_country": "au"
        },
        {
            "id": 3906,
            "title": "China's commitment to high-quality development benefits all -- experts",
            "text": "China has made important contributions to promoting world economic recovery, providing development dividends, and boosting global sustainable development, said overseas experts, noting that China's development experience can also be helpful for other countries. BEIJING, March 11 (Xinhua) -- China's commitment to pursuing high-quality development and building a community with a shared future for mankind has drawn global attention during its annual \"two sessions,\" and will further benefit the world, say experts worldwide. This year's \"two sessions,\" the gatherings of the National People's Congress and the National Committee of the Chinese People's Political Consultative Conference, held closing meetings on Friday and Thursday respectively. Such topics as expanding high-level opening-up, promoting green development and boosting global cooperation have received intense global attention. China has made important contributions to promoting world economic recovery, providing development dividends, and boosting global sustainable development, said overseas experts, noting that China's development experience can also be helpful for other countries. BOOST GLOBAL COOPERATION Munshi Faiz Ahmad, former chair of the Bangladesh Institute of International and Strategic Studies, said since the beginning of the COVID-19 pandemic, China has been playing a very constructive role in an effort to enhance cooperation among countries to combat the virus in a coordinated manner. He also said that China has been sharing resources with many countries, rich and poor, in an effort to defeat the pandemic, adding that \"China has succeeded in doing this because the democratic will of the people of China was fully behind the government policies as well expressed through the two sessions.\" Antoine Roger Lokongo, a professor of international politics and strategies at the Joseph Kasa-Vubu University, the Democratic Republic of the Congo, noted that Africa and other developing countries could learn from China's development. China's aid and investment are \"profoundly transforming Africa, especially in fields of infrastructure and rural development,\" said Lokongo. PRIORITIZE OPENING-UP It is \"enormously reassuring\" that China continues to be committed to the process of opening-up at the \"two sessions,\" said John Pang, a senior fellow at Bard College, New York. Pang noted that it is good to see China's support for the Regional Comprehensive Economic Partnership, a major free trade deal which came into force on Jan. 1 in China and nine other countries. Khairy Tourk, a professor of economics with the Stuart School of Business at the Illinois Institute of Technology in Chicago, said \"We see foreign direct investment flowing into China,\" adding that giants like Tesla and Apple are expanding their operations in China. \"I think the world feels grateful to China and its economic planners to keep the country on a trajectory that would promise better economic conditions not only in China but in the rest of the world,\" Tourk argued. PROMOTE GREEN DEVELOPMENT China is taking good steps to promote a green and low-carbon economy, said Alexandre Sebuhura, a senior lecturer of development studies at Kigali Independent University, Rwanda. Global challenges, for example climate change, will be dealt with once all countries push for co-existence between human and nature, Sebuhura added. Kostas Gouliamos, former rector of European University Cyprus, noted that China, sticking to people-centered policies, has moved faster to nurture green new drivers with the purpose of establishing a green technology innovation system.",
            "summary": "<p><figure><img src=\"https://cdn.bignewsnetwork.com/xih1647014752.jpg\" width=\"100%\" /><figcaption style=\"font-size:14px;color:grey;\">© Provided by Xinhua </figcaption></figure></p><p><strong>China has made important contributions to promoting world economic recovery, providing development dividends, and boosting global sustainable development, said overseas experts, noting that China's development experience can also",
            "url": "https://www.beijingbulletin.com/news/272380399/china-commitment-to-high-quality-development-benefits-all----experts",
            "image": "https://cdn.bignewsnetwork.com/xih1647014752.jpg",
            "publish_date": "2022-03-11 17:06:05",
            "language": "en",
            "source_country": "au"
        },
        {
            "id": 6454,
            "title": "Grimes says Elon Musk lives ‘below the poverty line’",
            "text": "Elon Musk may sometimes have “no income” and say “a lot of stupid s***”, but was doing so for the sake of humanity, according to his former partner and pop music artist Grimes. The singer, who was speaking with Vanity Fair in an interview from her home in Austin, Texas, this week said the Tesla founder “might say a lot of stupid s** but he does the right thing.” That apparently included his adventurous SpaceX mission to colonise Mars within five years as well as his SpaceX Starship rockets to transport humans to a future space colony millions of miles away from Earth. More recently, Mr Musk has been applauded for sharing his SpaceX Starlink satellite technology with Ukraine amid Russia’s invasion, as well as donating money to charity. Grimes, admitting that her “semi-separated” partner’s projects were otherworldly, told journalist Devin Gordon that SpaceX had been “hard” for its founder and CEO. “The Mars project is hard. There’s no income for it. There’s no way for it to make money,” said Grimes, who added that “It’s for the benefit of humanity, and it’s dangerous and it’s expensive, and people are like, He’s hoarding money! No, he’s spending everything on R&D.” “Bro does not live like a billionaire. ... Bro lives at times below the poverty line. To the point where I was like, ‘Can we not live in a very insecure $40,000 house? Where the neighbours, like, film us, and there’s no security, and I’m eating peanut butter for eight days in a row?’” Mr Musk, who founded Tesla before launching his SpaceX Mars Mission, is believed to be world’s wealthiest person, with a net worth of $247bn, according to Forbes. Grimes, his former partner, was quoted as saying that “We live in this society right now where people expect everyone to behave right, and talk right,” while not mentioning Mr Musk, with whom she seperasted from last September. “You have these manifestations of genius, but then you want them to behave normally—but the reason they’re like that is because they’re so disconnected from correct behavior,” she said. “Like, we fuck up. We’re all gonna do bad things in our life. We’re all gonna do stupid things.” Grimes said last year that she and Musk had split up, but that “there’s no real word for it. I would probably refer to him as my boyfriend, but we’re very fluid.” The pair have also been described as being “semi-separated”. She also accidentally revealed in her interview that she had recently given birth to a second child with Mr Musk, but said she was “not at liberty to speak about these things”. Fans reacted with surprise. Mr Musk has meanwhile faced criticism for funding a SpaceX project while apparently ignoring issues such as the climate crisis, and earlier this year was forced to delete a tweet comparing Canadian prime minister Justin Trudeau to Hitler for issuing a Covid mandate.",
            "summary": "Elon Musk may sometimes have “no income” and say “a lot of stupid s***”, but was doing so for the sake of humanity, according to his former partner and pop music artist Grimes.",
            "url": "https://www.independent.ie/style/celebrity/grimes-says-elon-musk-lives-below-the-poverty-line-41436779.html",
            "image": "https://www.independent.ie/style/celebrity/33caa/41436778.ece/AUTOCROP/w1240h700/IF%20Grimes",
            "publish_date": "2022-03-11 16:40:46",
            "author": "Gino Spocchia",
            "language": "en",
            "source_country": "ie"
        },
        {
            "id": 8754,
            "title": "Gas Price Hits are Soaring—Is It Time to Buy an Electric Vehicle?",
            "text": "Gas prices have jumped tremendously in the past week amid the economic fallout from Russia’s invasion of Ukraine. On March 10, two days after President Biden announced a ban on Russian oil imports, the U.S. national average gas price reached $4.31 per gallon, according to the American Automobile Association. Now that driving a car powered by fossil fuels gets more expensive by the day, does it make sense to finally switch to electric? Historically, abrupt jump in gas prices often led to increased demand for electric and hybrid vehicles. This was the case during oil price spikes in 2008 and 2011, according to automotive information site Edmunds.com. But the situation is different this time. As oil prices surge, electric vehicles are increasingly expensive as well—for a host of reasons. And, like just about every other type of vehicle, they are in short supply. First, there is the ongoing chip shortage caused by pandemic-related production disruption. Additionally, some key raw materials of electric vehicle batteries are seeing price spikes like that of oil as the war rattles commodity markets. “Electric vehicles are more dependent on microchips and rare earth metals than traditional vehicles, making the industry challenges of the past two years particularly costly for EVs,” said Karl Brauer, an executive analyst of the automotive research site iSeeCars. The price of nickel, a main component of EV batteries, has jumped 400 percent since the war in Ukraine began, according to data compiled by the Wall Street Journal. On Tuesday, nickel contracts skyrocketed so rapidly that the London Metal Exchange, the world’s largest exchange of industrial metal futures, had to suspend trading. There is no direct sanctions on Russian metal exports yet. But prices of nickel and other metal commodities have been surging for weeks as talks of the West’s ban on Russian oil export drive concerns that metals could also be targeted. Tight Supply Is Driving Up the Price of Electric Vehicles Then, there is the supply squeeze. A record-low inventory of new cars—both electric and gas-powered—have driven up prices at both dealerships and used car markets. A Tesla Model 3 Long Range sedan, one of the best-selling electric vehicles in the U.S., cost $48,000 in March 2021, according to tech news site electrek. Now, it’s selling for $52,000 (before potential tax savings) on Tesla’s website. Some used Model 3 cost even more. According to a February study by iSeeCars, a one-year-old Tesla Model 3 cost $8,300 (or 17.8 percent) more, than a new one. At the end of 2021, inventory levels at U.S. car dealership were at their lowest since the 2008 Financial Crisis, according to a report from the automotive analytics firm IHS Markit. “These issues should eventually be resolved, but the current state of the world is not friendly to EV production,’ iSeeCars’ Brauer said. “(It’s) cutting profits and forcing price hikes in many instances.” Cost factors aside, there are also EV makers who seem to hike up prices just because they can. Rivian, the Amazon-backed EV startup whose electric pickup is rated “2022 Truck of the Year” by MotorTrend magazine, recently announced a nearly 20 percent price increase on their most popular pickup and SUV models. (Rivian later reversed the price increases after meeting strong customer backlash, including a shareholder lawsuit.) Rivian has delivered only about 1,000 vehicles to date and hasn’t begun mass production. It’s unclear how supply chain constraints would affect its cost economics. Most hybrid and fully-electric vehicles are more expensive than their gas-powered equivalents. The time it takes for owners to offset that premium withtax rebates and gas savings varies from model to model. When asked whether now is a good time to buy an electric vehicle, Brauer said, “It’s not a great time to buy an EV but it’s no worse than anything else given the current market conditions.”",
            "summary": "Electric vehicles are increasingly expensive as prices of key raw materials soar during the war.",
            "url": "https://observer.com/2022/03/gas-price-record-high-buy-electric-vehicle/",
            "image": "https://observer.com/wp-content/uploads/sites/2/2022/03/GettyImages-1239039249.jpeg?quality=80&strip",
            "publish_date": "2022-03-10 21:45:49",
            "author": "Sissi Cao",
            "language": "en",
            "source_country": "us"
        },
        {
            "id": 11870,
            "title": "Grimes splits from Elon Musk after accidentally confirming they had another baby, Exa Dark Sideræl",
            "text": "Grimes and billionaire Elon Musk have split up again after the shock announcement that they had welcomed a second baby secretly. The musician stunned fans when she admitted to having a second child after a Vanity Fair interviewer heard crying in her house; she told the magazine that she had welcomed a baby via surrogate after a difficult first pregnancy. Grimes described Tesla CEO Musk as her “boyfriend”, adding that “we’ve always wanted at least three or four (children)”. However, shortly after the interview was published, Grimes, 33, then announced on Twitter that she and Musk had split again, following a break-up in September last year. She wrote: “Me and E have broken up *again* since the writing of this article haha, but he’s my best friend and the love of my life, and my life and art are forever dedicated to The Mission now.” Me and E have broken up *again* since the writing of this article haha, but he’s my best friend and the love of my life, and my life and art are forever dedicated to The Mission now, I think Devin wrote that part of the story rly well. Sique – peace out —",
            "summary": "<p>Grimes and billionaire Elon Musk have split up again after the shock announcement that they had welcomed a second baby secretly. The musician stunned fans when she admitted to having a second child after a Vanity Fair interviewer heard crying in her house; she told the magazine that she had welcomed a baby via surrogate &#8230; <a href=\"https://www.pinknews.co.uk/2022/03/11/grimes-elon-musk-split-baby-name/\">Continued</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.pinknews.co.uk/2022/03/11/grimes-elon-musk-split-baby-name/\">Grimes splits from Elon Musk after accidentally confirming they had another baby, Exa Dark Sideræl</a> appeared first on <a rel=\"nofollow\" href=\"https://www.pinknews.co.uk\">PinkNews | Latest lesbian, gay, bi and trans news | LGBT+ news</a>.</p>",
            "url": "https://www.pinknews.co.uk/2022/03/11/grimes-elon-musk-split-baby-name/",
            "image": "https://s31242.pcdn.co/wp-content/uploads/2022/03/GettyImages-1128719706-scaled.jpg",
            "publish_date": "2022-03-11 10:20:47",
            "author": "Emily Chudy",
            "language": "en",
            "source_country": "uk"
        },
        {
            "id": 12802,
            "title": "Nio ET7 flagship first review & test drive. Best EV up to date?",
            "text": "Deliveries of Nio’s new ET7 begin to lucky customers from late March, and we have already had a sneak preview of what the car is like. This car changes Nio from the company it is today to the company it is tomorrow, and its importance cannot be overstated. Nio is probably the best known of the three leading Chinese start-ups, the others being XPeng and Li Auto. Up to now, Nio has only produced SUVs and is well known for its battery swapping. The brand launched in Norway last year, and at the 2021 Nio Day announced plans to be on sale in 25 markets by the end of 2025. While Nio launched in Norway with the existing ES8 model, all new markets will only get the second-generation models. Leading that push is the ET7, the first of three cars to go on sale this year on the new platform. What’s the big deal about the new platform? First off, it is not just about dynamic improvements; it allows for much better driving assistance capabilities than the first generation. The ET7 is the first Nio car to feature Lidar. XPeng generally has a better reputation when it comes to driving assistance, but I was pleasantly surprised by the ability of the ES6 when I test drove one last year. It was able to undertake lane changes on the highway by itself, which I had not expected. The ET7, using Lidar, will take this to the next level. Unfortunately, as with Chinese cars on launch, these features are not yet operational, so testing them will need to wait for another time. Exterior Unlike the Weltmeister M7, which has wart-like protrusions all over, Nio has done an excellent job integrating the sensors. The most prominent is just above the windscreen, which houses the Lidar sensor flanked on either side by 8-megapixel high-resolution cameras in what Nio refers to as the Watchtower sensor layout. The ET7 has a remarkably slippery 0.208 drag coefficient despite these slight bumps. And if there is one word that best sums up the exterior design, it is sleek. But it’s not just about aerodynamics; the finished result is a genuinely good-looking car. Interior Looking at pictures, it is easy to think the interior of the ET7 is just like any other Nio. Indeed the setup is very familiar, albeit more minimalistic however the materials and overall quality are a huge step up. That’s not to say they’re bad on older Nio models, but on my test day, I rode in an ES8, and you could certainly feel the difference. On the ET7, the tactile experience raises the bar and is more than a match for the German trio. Rattan inserts find their first application on a production car. Not only are they more environmentally friendly, thanks to being renewable, but they have a charming textured feel. These cover huge swathes of the front and back, notably on the center console, dashboard dividing line, and electric window buttons. Although Nio offers a vegan leather seat trim, my test car came with Nappa leather. According to Nio, they use up to forty percent more than other brands and use it not just on the visible seat parts but also on inserts and the steering wheel. Coupled with microfiber headlining, it adds up to a very comfortable environment. There is no glove box on the ET7, but there’s plenty of space under the floating center console like other Nio cars. One unusual feature is the cubby hole on the center console. This can act as a safe with access either by facial recognition or inputting a code, and also, rather than a more normal rear-hinged opening can open to either side. Inside are two USB ports, including the only Type A in the whole car, along with a 12V outlet. Thanks to the panoramic roof, the back is very light and airy, and despite a fairly raked roofline, headspace should be acceptable for all but the tallest passengers. Nio makes a big deal of benchmarking the ET7 against the long-wheelbase 5 series, and indeed legroom is a good plus; without a raised center tunnel, the middle passenger has more comfortable seating. Rear passengers get an LCD panel mounted on the back of the center console to control climate and seat functions. Underneath is a Type C USB outlet, and another is in the compartment of the fold-down armrest. Like the front seats, outer passengers in the rear get heating, cooling, and massage functions. The ET7 doesn’t have a drunk, but boot space is generous, and the hatch gets electric opening and closing. Performace & driving feel Track driving gave the ability to test acceleration, braking, and handling. In Sport+ mode, the quoted acceleration time is 3.8 seconds, but Nio is keen to point out that this is based on the car being half-loaded, and with just a driver, it should be faster still. With the stronger (300kW 500Nm) of the two electric motors at the back, the ET7 noticeably pitches up when accelerating hard. Once at 100km/h, the car needs 33.5 meters to bring it to a standstill when the brakes are fully applied. This is most appreciable when doing an elk test here. The car has often come to a standstill before the zig-zag maneuver is complete. There is no doubt the ET7 is large, but it’s surprisingly nimble when doing a slalom and body roll, thanks to the air suspension is not an issue. Currently, there are four drive modes in addition to Sport+, there being a Sport, Comfort, and Eco setting. There is also a Custom option to pick and mix the settings for acceleration, regenerative braking, ride height, suspension stiffness, steering weight, and air conditioning. Custom allows you to drop the acceleration figure right down to 12.9 seconds, where the car becomes only front-wheel drive, which perhaps reveals the car’s biggest problem. Unlike the Zeekr 001 and XPeng P7, which have an RWD bias in their AWD versions, the ET7 usually uses the front wheels (180kW 350Nm) for power except under heavy acceleration when traction on all four wheels is required. In Comfort, the acceleration drops to 7.9 seconds which is fine for everyday driving, but in every mode bar Sport+, the steering is light. Perhaps it was just my driving, but for some reason, I managed to get the steering wheel wholly disorientated on two occasions, not something I usually experience. The top braking regeneration level gets labeled as Standard says a lot. The car doesn’t drop speed that quickly when you remove your foot from the accelerator, and true one-pedal driving is undoubtedly not possible as it will just go down to around an 8km/h coast. Range depends on various factors such as mode, but the 21-inch tires on our test car reduce the maximum range of the 100kWh battery pack version from 705km to 615km. There is also a 75kWh pack available on launch. Later in the year, a 150kWh semi-solid state battery should be an option, giving a range of over 1000km. One thing to be noted is that Nio is now using the new China-only CLTC standard, which is even more generous than NEDC for range. Sum up Thanks to the head-up display and proper instrument panel, situational awareness is good. Most things are controlled through the center screen. The car tested was a pre-production model with earlier software than models set for delivery. As such, it did not have an option for English which is meant to debut on the ET7; nonetheless, navigation and response times of the screen seem to be much better than with earlier Nio cars. It is also possible to control many functions through voice via Nio’s digital assistant Nomi. That the ET7 was benchmarked against a 5 series is telling. Nio clearly intends to go after German premium brands rather than just Tesla. Initial impressions show that the ET7 ticks the right boxes for most metrics. The last car I test drove was an Audi A7L which in China is around RMB130,000 ($20,500 | €18,600) more expensive, and I couldn’t help but feel the ET7 was much better in terms of performance, materials, and equipment. Prices for the Nio ET7 in China start at RMB448,000 ($70,900 | €64,100) and go up to RMB526,000 ($83,250 | €75,250) for the Premier Edition as tested. Verdict Power & Drive feeling: 7Passenger space: 9Tech and UX: 6*Price quality ratio: 10 *largely because not fully operable and also not the English system to fully test The best thing: Premium feel The worst thing: FWD bias Total: 94% CNC Rating. Overall: With this car, Nio announces it is more than ready for Europe; the question is whether Europe is ready for Nio? Very impressive performance and a premium feel, full judgment has to be withheld until the full driving assistance suite can be tested. Is it the best EV from Nio so far? Definitely yes. Is it the world’s best EV up to date? That would be too bold a statement right now. But ET7 definitely shows Nio is on the right way to dominate the premium EV sector. If this is still not enough for you, you can check the video review from Will More reviews from China",
            "summary": "<p>Deliveries of Nio&#8217;s new ET7 begin to lucky customers from late March, and we have already had a sneak preview of what the car is like. This car changes Nio from the company it is today to the company it is tomorrow, and its importance cannot be overstated. Nio is probably the best known of [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://carnewschina.com/2022/03/10/nio-et7-flagship-first-review-test-drive-best-ev-up-to-date/\">Nio ET7 flagship first review &#038; test drive. Best EV up to date?</a> appeared first on <a rel=\"nofollow\" href=\"https://carnewschina.com\">CarNewsChina.com</a>.</p>",
            "url": "https://carnewschina.com/2022/03/10/nio-et7-flagship-first-review-test-drive-best-ev-up-to-date/",
            "image": "https://carnewschina.com/wp-content/uploads/2022/03/Featured-Img-update.png",
            "publish_date": "2022-03-10 18:17:48",
            "author": "Mark Andrews",
            "language": "en",
            "source_country": "cn"
        }
    ]
}