{
  "data": [
    {
      "id": "3677531920226142766",
      "title": "The Hits",
      "url": "https://www.voanews.com/a/6961551.html",
      "description": "VOA1 is the Voice of Americas 24/7 English language music network. Hear the freshest cuts from chart-toppers Beyonc, Justin Timberlake, Lady Gaga, Bruno Mars, Rihanna, Pink, One Direction, Taylor Swift, Katy Perry, and more.",
      "body": "\n\nVOA1 is the Voice of Americas 24/7 English language music network. Hear the freshest cuts from chart-toppers Beyonc, Justin Timberlake, Lady Gaga, Bruno Mars, Rihanna, Pink, One Direction, Taylor Swift, Katy Perry, and more.",
      "snippet": "... freshest cuts from chart-toppers Beyonc, Justin Timberlake, Lady Gaga, Bruno Mars, Rihanna, Pink, One Direction, <b><b>Taylor Swift</b></b>, Katy Perry, and more.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-28T09:05:00",
      "provider": {
        "name": "voanews",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.voanews.com/Content/responsive/VOA/img/top_logo_news.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "voanews",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.voanews.com/a/6961551.html"
      }
    },
    {
      "id": "8286176415481685186",
      "title": "RAW: Which former WWE Champion seemingly has a vendetta against Taylor Swift?",
      "url": "https://www.sportskeeda.com/wwe/raw-which-former-wwe-champion-seemingly-vendetta-taylor-swift",
      "description": "Taylor Swift has often been the subject of many discussions and segments across industries. Over the past few weeks, the Grammy Award winner has seemingly been on The Miz's radar.",
      "body": "Taylor Swift has often been the subject of many discussions and segments across industries. Over the past few weeks, the Grammy Award winner has seemingly been on The Miz's radar.A couple of weeks ago, on an edition of Miz TV, the host had Seth Rollins as a special guest. During the segment, the crowds started singing The Visionary's theme, much to The A-Lister's chagrin. He then claimed that he would rather listen to Taylor Swift sing than give the fans any attention.This week, the former WWE Champion hosted another edition of his talk show on RAW. Rollins again interrupted him in a bid to get through to Logan Paul by getting his contact details from The Miz. However, fans got under his skin again with The Visionary's theme. He responded with a reference to the Grammy Award winner's hit 'Anti-Hero' from her recent album Midnights. \"The gift is life changing and to help me announce this highlight worthy news, I want to bring out my special guest. He is also the host of WrestleMania. Drumroll please. 'It's me, hi, I'm tonight's guest, it's me.\" said The Miz. [00:05 - 00:34]At the commencement of the segment, the multi-time WWE Champion claimed he was the host for WrestleMania this year, given their theme of 'going Hollywood', and how he was the apt star to take on the role.The Miz managed to get tickets to Taylor Swift's Eras TourLast year, Taylor Swift announced the Eras tour to promote her latest album. It will commence in March this year and end in August. As soon as news spread of the 33-year-old's event, ticketing platform Ticketmaster crashed owing to the massive number of fans logging in to book a spot to attend the event.In the aftermath of the crash, the platform issued a statement stating that they were looking into the matter and cited that they were not prepared for sales of that magnitude. They announced the postponement of the remainder of pthe pre-sold tickets, which was later canceled, given the high demand. This garnered a lot of backlash from fans who called out the flaws in their ticketing model.The Miz was one of the lucky few to get access to the tickets, which he proudly announced on RAW last week.folklorian medusa@prihhciousAlso The Miz bragging about getting Taylor Swift tickets  Mother Taylor is everywhereAlso The Miz bragging about getting Taylor Swift tickets  Mother Taylor is everywhereThe Miz has had multiple associations with various celebrities on and off WWE and represented the company at NBA, NFL Draft picks, Celebrity Family Feuds, and many other events.",
      "snippet": "<b><b>Taylor Swift</b></b> has often been the subject of many discussions and segments across industries. Over the past few weeks, the Grammy Award winner has ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-28T04:19:56",
      "provider": {
        "name": "sportskeeda",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://staticc.sportskeeda.com/editor/2023/02/a9309-16775577844254-1920.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "sportskeeda",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.sportskeeda.com/wwe/raw-which-former-wwe-champion-seemingly-vendetta-taylor-swift"
      }
    },
    {
      "id": "6548566580268262518",
      "title": "Live Nation says Taylor Swift fans can't sue over ticket debacle Entertainment News",
      "url": "http://www.asiaone.com/entertainment/live-nation-says-taylor-swift-fans-cant-sue-over-ticket-debacle",
      "description": "Live Nation Entertainment Inc and subsidiary Ticketmaster LLC asked a USjudge on Friday (Feb 24) to halt a proposed consumer class action over their sales of Taylor Swift concert tickets and instead force claims to be heard privately in... - Read more at AsiaOne",
      "body": "Reuters\nFeb 28, 2023\nSinger Taylor Swift arrives to speak at the Toronto International Film Festival in Toronto, Ontario, Canada on Sept 9, 2022.\nPHOTO: Reuters file\nLive Nation Entertainment Inc and subsidiary Ticketmaster LLC asked a US judge on Friday (Feb 24) to halt a proposed consumer class action over their sales of Taylor Swift concert tickets and instead force claims to be heard privately in arbitration.\nThe companies are hoping to head off a lawsuit in Los Angeles, California, federal court accusing them of violating antitrust and consumer protection laws.\nDemand from fans, scalpers and bots for Swift's first tour in five years caused the Ticketmaster site to crash last fall, and raised new scrutiny from US lawmakers and others about what critics say is a lack of competition in the ticketing market.\nThe December lawsuit alleged the 2010 merger of Live Nation and Ticketmaster eliminated market competition and let the companies charge higher prices for Swift tickets than they otherwise could.\nCompanies generally favour arbitration over court litigation to try to quickly resolve matters and limit potential damages. Antitrust cases in US court expose a company to the possibility of trebled damages.\nIn its Friday court filing, Beverly Hills-based Live Nation said the ticket purchaser who filed the case \"repeatedly agreed\" to arbitrate any claims arising from her use of Ticketmaster's online systems.\nLive Nation has successfully argued in other cases that users of its online ticketing platforms agreed to arbitrate disputes. The company pointed the Los Angeles court to a 9th US Circuit Court of Appeals ruling this month that upheld arbitration in an antitrust suit against the ticket company.\nAttorneys for Live Nation called the 9th Circuit decision on Feb 13 \"binding authority\" that \"can and should end\" the Los Angeles court's enquiry.\nLawyers for the plaintiff and Live Nation did not immediately respond to requests for comment on Monday.\nALSO READ:",
      "snippet": "... (Feb 24) to halt a proposed consumer class action over their sales of <b><b>Taylor Swift</b></b> concert tickets and instead force claims to be heard privately in.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-28T02:34:21",
      "provider": {
        "name": "asiaone",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.asiaone.com/sites/default/files/styles/a1_og_image/public/original_images/Feb2023/20230228_taylorswift_reuters.jpeg?itok=YXj1HvnV",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "asiaone",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "http://www.asiaone.com/entertainment/live-nation-says-taylor-swift-fans-cant-sue-over-ticket-debacle"
      }
    },
    {
      "id": "4592181941590359277",
      "title": "Scooter Braun Talks Taylor Swift Big Machine Records on Bloomberg Show",
      "url": "https://variety.com/2023/tv/news/scooter-braun-taylor-swift-big-machine-records-bloomberg-idea-generation-1235534785/",
      "description": "Scooter Braun discussed his Taylor Swift feud in the Season 3 premiere of 'Idea Generation.'",
      "body": "Scooter Braun guest stared in the Season 3 premiere of Bloombergs Idea Generation to discuss is feud with Taylor Swift, among other topics. Speaking with series host Noah Callahan-Bever, Braun talked about his purchase of Big Machine Records, as well as his thoughts on managers responsibilities, work/life balance and his relationships. Speaking on his back-and-forth []",
      "snippet": "Scooter Braun discussed his <b><b>Taylor Swift</b></b> feud in the Season 3 premiere of ... Idea Generation to discuss is feud with <b><b>Taylor Swift</b></b>, among other topics.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-28T01:32:06",
      "provider": {
        "name": "variety",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://variety.com/wp-content/uploads/2023/01/Scooter-Braun-2022-Credit-Bradford-Rogne.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "variety",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://variety.com/2023/tv/news/scooter-braun-taylor-swift-big-machine-records-bloomberg-idea-generation-1235534785/"
      }
    },
    {
      "id": "841415404982569641",
      "title": "Grammys 2024: Taylor Swift (Midnights) for Album of the Year?",
      "url": "https://www.goldderby.com/article/2023/grammys-2024-taylor-swift-midnights-album-of-the-year/",
      "description": "She would make history as the first artist to claim four wins in the category, but we've got a long way to go this eligibility year.",
      "body": "The 2023 Grammys just took place on February 5, but the eligibility period for 2024 is already almost half over, so we launched our predictions for Album of the Year. Theres still a long way to go, but at this early stage things are looking good for Taylor Swift, whose Midnights is the early front-runner []",
      "snippet": "Theres still a long way to go, but at this early stage things are looking good for <b><b>Taylor Swift</b></b>, whose Midnights is the early front-runner [].",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-27T21:00:19",
      "provider": {
        "name": "goldderby",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://www.goldderby.com/wp-content/uploads/2023/01/taylor-swift-midnights.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "goldderby",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.goldderby.com/article/2023/grammys-2024-taylor-swift-midnights-album-of-the-year/"
      }
    },
    {
      "id": "62116488790797142",
      "title": "Taylor Swift Ties the Record for Most Adult Pop",
      "url": "https://www.onenewspage.com/n/World/1zpkbh2ac7/Taylor-Swift-Ties-the-Record-for-Most-Adult.htm",
      "description": "Taylor Swift matches the mark for the most top 10 hits in the history of Billboards Adult Pop Airplay..  World  One News Page: Monday, 27 February 2023",
      "body": "Taylor Swift Ties the Record for Most Adult Pop Airplay Chart Top 10s With Lavender Haze\nPublished\n27 Feb 2023\nTaylor Swift matches the mark for the most top 10 hits in the history of Billboards Adult Pop Airplay chart, as Lavender Haze lifts from No. 11 to No. 9 on the tally dated March 4. The song, released on Republic Records, becomes Swifts 27th Adult Pop Airplay top 10, equaling Maroon 5 for the\n#taylorswift #republicrecords #maroon5 #billboards #rihannatalks #swift #myguitar #antihero #adultpopairplay #kellyclarkson",
      "snippet": "<b><b>Taylor Swift</b></b> matches the mark for the most top 10 hits in the history of Billboards Adult Pop Airplay. World One News Page: Monday, 27 February 2023.",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-27T20:47:08",
      "provider": {
        "name": "onenewspage",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.newsserve.net/ONPglobe256.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "onenewspage",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.onenewspage.com/n/World/1zpkbh2ac7/Taylor-Swift-Ties-the-Record-for-Most-Adult.htm"
      }
    },
    {
      "id": "7963431652990634230",
      "title": "20 Taylor Swift Songs That Probably Wont Make The",
      "url": "https://www.onenewspage.com/n/World/1zpkbh2a6j/20-Taylor-Swift-Songs-That-Probably-Won.htm",
      "description": "All bets are off as Taylor Swifts feverishly anticipated The Eras Tour  her first roadshow unbeholden..  World  One News Page: Monday, 27 February 2023",
      "body": "20 Taylor Swift Songs That Probably Wont Make The Eras Tour Setlist (But Really Should)\nPublished\n27 Feb 2023\nAll bets are off as Taylor Swifts feverishly anticipated The Eras Tour  her first roadshow unbeholden to a particular album release  prepares to embark March 17 in Glendale, Arizona. It stands to reason that Swift would heavily showcase the heap of music shes produced since her record-setting\n#taylorswifts #erastour #glendale #arizona #folkloreandevermore #swift #swifties #eras #timmcgraw #oursong",
      "snippet": "20 <b><b>Taylor Swift</b></b> Songs That Probably Wont Make The Eras Tour Setlist (But Really Should) Published 27 Feb 2023 All bets are off as <b><b><b>Taylor Swift</b></b>s</b> ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-27T20:47:08",
      "provider": {
        "name": "onenewspage",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.newsserve.net/ONPglobe256.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "onenewspage",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.onenewspage.com/n/World/1zpkbh2a6j/20-Taylor-Swift-Songs-That-Probably-Won.htm"
      }
    },
    {
      "id": "2386648229787374457",
      "title": "The Rise And Fall Of Music Formats: A Visual Guide",
      "url": "https://celebrityaccess.com/2023/02/27/the-rise-and-fall-of-music-formats-a-visual-guide/",
      "description": "(Hypebot) -- As the multi-year resurgence in vinyl proved, and Taylor Swifts recent download flash salereaffirmed, old music formats seldom really die. But their trajectory does reveal what James English calls the process of creative",
      "body": "Taylor Swifts recent download flash sale\nreaffirmed, old music formats seldom really die. But their trajectory does reveal what James English calls the process of creative destruction.\nThis video, created by Eagle using RIAA data, tracks sales of different music formats in the U.S. over the last 50 years.\nThey show the process of creative destruction, he writes. (music formats) show the shift from analog to digital. They even demonstrate the move from physical to intangible.\nBelow the video, weve also posted a similar 2018 graphic from\nthat inspired Eagle which tracked similar data. Its amazing how much has changed in just four years.\nFrom 2018",
      "snippet": "As the multi-year resurgence in vinyl proved, and <b><b>Taylor Swifts</b></b> recent download flash salereaffirmed, old music formats seldom really die. But their ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-27T17:44:23",
      "provider": {
        "name": "celebrityaccess",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://celebrityaccess.com/wp-content/uploads/2018/02/compactdiscs2018.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "celebrityaccess",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://celebrityaccess.com/2023/02/27/the-rise-and-fall-of-music-formats-a-visual-guide/"
      }
    },
    {
      "id": "7889136627460535425",
      "title": "When Taylor Swift Took A Jibe At Tina Fey & Amy Poehler For Mocking Her Love Life, \"There's A Special Place In Hell For...\"",
      "url": "https://www.koimoi.com/hollywood-news/when-taylor-swift-took-a-jibe-at-tina-fey-amy-poehler-for-mocking-her-love-life-theres-a-special-place-in-hell-for/",
      "description": "Taylor Swift once made headlines for taking a jibe at comedians Tina Fey and Amy Poehler who mocked the singer's love life. Read on",
      "body": "Hollywood News\nWhen Taylor Swift Took A Jibe At Tina Fey & Amy Poehler For Mocking Her Love Life, Theres A Special Place In Hell For\nTaylor Swift once made headlines for taking a jibe at comedians Tina Fey and Amy Poehler who mocked the singer's love life. Read on\nBy\n-\nFebruary 27, 2023\nWhen Taylor Swift Took A Jibe At Tina Fey & Amy Poehler For Mocking Her Love Life ( Photo Credit  Instagram ; Facebook )\nAmerican singer-songwriter Taylor Swift is well known for her genre-spanning discography and artistic reinventions. She is also known for dishing out plenty of jibes to ex-lovers in her songs. However, the country singer once made headlines for taking a jibe at comedians Tina Fey and Amy Poehler.\nThe Grammy-winning singer is well known for documenting her personal relationships in her songs, often leaving little clues in the lyrics that hint at the subject. She has been linked to several high-profile celebrities such as John Mayer, Jake Gyllenhaal, Taylor Lautner, Joe Jonas, Conor Kennedy, and One Directions Harry Styles.\nAdvertisement\nAdvertisement\nBack in 2013, Tina Fey and Amy Poehler hosted the Golden Globe Awards. At the award ceremony, the comedians mocked Taylor Swifts love life. They said to the singer to stay away from actor Michael J. Foxs 23-year-old son. But this did not go down well with Swift.\nTrending\nJK Rowlings Abusive Husband Claims Credit For Her Harry Potter Series I Was Participating In It & Dismisses Accusations Of Holding Her Books As Hostage\nBad Blood singer talking to Vanity Fair responded to the Golden Globes incident by citing a saying told to her by talk show host Katie Couric, theres a special place in hell for women who dont help other women. She did not stop there.\nTaylor Swift further said, For a female to write about her feelings, and then be portrayed as some clingy, insane, desperate girlfriend in need of making you marry her and have kids with her, I think thats taking something that potentially should be celebrated  a woman writing about her feelings in a confessional way  thats taking it and turning it and twisting it into something that is frankly a little s*xist.",
      "snippet": "<b><b>Taylor Swift</b></b> once made headlines ... love life. Hollywood News When <b><b>Taylor Swift</b></b> Took A Jibe At ... Place In Hell For <b><b>Taylor Swift</b></b> once made headlines for ...",
      "keywords": "",
      "language": "en",
      "isSafe": false,
      "datePublished": "2023-02-27T16:37:27",
      "provider": {
        "name": "koimoi",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://static-koimoi.akamaized.net/wp-content/new-galleries/2023/02/when-taylor-swift-took-a-jibe-at-tina-fey-read-on-001.jpg",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "koimoi",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.koimoi.com/hollywood-news/when-taylor-swift-took-a-jibe-at-tina-fey-amy-poehler-for-mocking-her-love-life-theres-a-special-place-in-hell-for/"
      }
    },
    {
      "id": "6025712727111123570",
      "title": "New weight-loss treatments are not just a TikTok trend",
      "url": "https://www.onenewspage.com/n/World/1zpkbh21bm/New-weight-loss-treatments-are-not-just.htm",
      "description": "No, Im not talking about how to get Taylor Swift tickets. Im talking about a new class of medications offering a first-of-its kind promise for those with",
      "body": "New weight-loss treatments are not just a TikTok trend\nPublished\n27 Feb 2023\nNo, Im not talking about how to get Taylor Swift tickets. Im talking about a new class of medications offering a first-of-its kind promise for those with weight-loss goals: glucagon-like peptide 1 (GLP-1) agonists, or Wegovy, to name one for easier googling. GLP-1 medications support weight loss\n#taylorswift #glp1 #andorobese #saxenda #20plus #telehealth #tzvidoron",
      "snippet": "No, Im not talking about how to get <b><b>Taylor Swift</b></b> tickets. Im talking about a new class of medications offering a first-of-its kind promise for those ...",
      "keywords": "",
      "language": "en",
      "isSafe": true,
      "datePublished": "2023-02-27T10:39:07",
      "provider": {
        "name": "onenewspage",
        "favIcon": "",
        "favIconBase64Encoding": ""
      },
      "image": {
        "url": "https://cdn.newsserve.net/ONPglobe256.png",
        "height": 0,
        "width": 0,
        "thumbnail": "",
        "thumbnailHeight": 0,
        "thumbnailWidth": 0,
        "base64Encoding": "",
        "name": null,
        "title": null,
        "provider": {
          "name": "onenewspage",
          "favIcon": "",
          "favIconBase64Encoding": ""
        },
        "imageWebSearchUrl": null,
        "webpageUrl": "https://www.onenewspage.com/n/World/1zpkbh21bm/New-weight-loss-treatments-are-not-just.htm"
      }
    }
  ]
}
